Machine Learning Astronomy Related Project

In [27]:
import kagglehub 

path = kagglehub.dataset_download("datascientist97/astronomical-data")
print(f'path to dataset files {path}')

Warning: Looks like you're using an outdated `kagglehub` version (installed: 0.3.9), please consider upgrading to the latest version (0.3.10).
path to dataset files /home/codespace/.cache/kagglehub/datasets/datascientist97/astronomical-data/versions/1

In [28]:
import pandas as pd
import os 

print(os.listdir(path))   #this command is to retrieve the exact file name cotaining the data

['cleaned_star_data.csv']

In [29]:
file_path = os.path.join(path, 'cleaned_star_data.csv')      #creating the file path so i can use pandas to open it
df = pd.read_csv(file_path)
df.head(10)

,Temperature (K),Luminosity(L/Lo),Radius(R/Ro),Absolute magnitude(Mv),Star type,Star color,Spectral Class
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,3042,0.0005,0.1542,16.6,0.0,Red,M
2,2600,0.0003,0.102,18.7,0.0,Red,M
3,2800,0.0002,,16.65,0.0,Red,M
4,1939,0.000138,0.103,20.06,0.0,Red,M
5,2840,,0.11,16.98,0.0,Red,M
6,2637,0.00073,0.127,17.22,0.0,Red,M
7,2600,0.0004,0.096,17.4,0.0,Red,M
8,2650,0.00069,0.11,17.45,0.0,Red,M
9,2700,0.00018,0.13,16.05,0.0,Red,M

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 240 entries, 0 to 239
Data columns (total 7 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Temperature (K)         239 non-null    object
 1   Luminosity(L/Lo)        239 non-null    object
 2   Radius(R/Ro)            239 non-null    object
 3   Absolute magnitude(Mv)  239 non-null    object
 4   Star type               239 non-null    float64
 5   Star color              239 non-null    object
 6   Spectral Class          239 non-null    object
dtypes: float64(1), object(6)
memory usage: 13.3+ KB

In [31]:
df.describe()

       Star type
count  239.00000
mean     2.51046
std      1.70728
min      0.00000
25%      1.00000
50%      3.00000
75%      4.00000
max      5.00000

The Data I found in Kaggle doesn't seem to be cleaned or organized, there are even some missing ones, so I will try to clean it so I can use it without having trouble with biases.

In [32]:
#first, I will check for duplicated rows

index_list=df[df.duplicated(keep=False)].index.tolist()
if not index_list : 
    print('list is empty, there are no duplicated rows')
else :
    print(j for j in index_list)

list is empty, there are no duplicated rows

It appears that there are no duplicated rows !

In [33]:

#df.duplicated(keep=False) return a series of True (for duplicated rows) and/or False (for unique rows).
# the df[df.duplicated(keep=False)] keeps the case where df.duplicated(keep=False) is true, hence duplicated.

df[df.duplicated(keep=False)]

Empty DataFrame
Columns: [Temperature (K), Luminosity(L/Lo), Radius(R/Ro), Absolute magnitude(Mv), Star type, Star color, Spectral Class]
Index: []

In [34]:
#Checking for missing values
df.isnull().sum()

Temperature (K)           1
Luminosity(L/Lo)          1
Radius(R/Ro)              1
Absolute magnitude(Mv)    1
Star type                 1
Star color                1
Spectral Class            1
dtype: int64

It appears that each column has exactly one missing value

In [35]:
new_df = df.drop(index=0) #deleting row with index = 0 because it contains missing values
new_df

,Temperature (K),Luminosity(L/Lo),Radius(R/Ro),Absolute magnitude(Mv),Star type,Star color,Spectral Class
1,3042,0.0005,0.1542,16.6,0.0,Red,M
2,2600,0.0003,0.102,18.7,0.0,Red,M
3,2800,0.0002,,16.65,0.0,Red,M
4,1939,0.000138,0.103,20.06,0.0,Red,M
5,2840,,0.11,16.98,0.0,Red,M
...,...,...,...,...,...,...,...
235,38940,374830,1356,-9.93,5.0,Blue,O
236,30839,834042,1194,-10.63,5.0,Blue,O
237,8829,537493,1423,-10.73,5.0,White,A
238,9235,404940,1112,-11.23,5.0,White,A
239,37882,294903,1783,-7.8,5.0,Blue,O

In [36]:
#Since I am used to index 0 being first and not 1, I am going to use .reset_index

new_df.reset_index()

,index,Temperature (K),Luminosity(L/Lo),Radius(R/Ro),Absolute magnitude(Mv),Star type,Star color,Spectral Class
0,1,3042,0.0005,0.1542,16.6,0.0,Red,M
1,2,2600,0.0003,0.102,18.7,0.0,Red,M
2,3,2800,0.0002,,16.65,0.0,Red,M
3,4,1939,0.000138,0.103,20.06,0.0,Red,M
4,5,2840,,0.11,16.98,0.0,Red,M
...,...,...,...,...,...,...,...,...
234,235,38940,374830,1356,-9.93,5.0,Blue,O
235,236,30839,834042,1194,-10.63,5.0,Blue,O
236,237,8829,537493,1423,-10.73,5.0,White,A
237,238,9235,404940,1112,-11.23,5.0,White,A
238,239,37882,294903,1783,-7.8,5.0,Blue,O

In [37]:
new_df.isnull().sum()

Temperature (K)           0
Luminosity(L/Lo)          0
Radius(R/Ro)              0
Absolute magnitude(Mv)    0
Star type                 0
Star color                0
Spectral Class            0
dtype: int64

I no longer have NaN values, but I still notice some empty columns, so I will work on that now.

In [38]:
print((df==" ").sum())   #I specified the space " " to retrieve empty columns

Temperature (K)           2
Luminosity(L/Lo)          6
Radius(R/Ro)              7
Absolute magnitude(Mv)    5
Star type                 0
Star color                6
Spectral Class            2
dtype: int64

Now, I will replace the empty spaces with NaN to facilitate the process of replacing them. For more information please visit this page https://sparkbyexamples.com/pandas/pandas-replace-blank-values-with-nan/#:~:text=Pandas%20Replace%20Blank%20Values%20with,case%20of%20the%20specified%20value.

In [39]:
newest_df = new_df.mask(new_df == " ")

#now checking if missing values are detected
newest_df.isnull().sum()

Temperature (K)           2
Luminosity(L/Lo)          6
Radius(R/Ro)              7
Absolute magnitude(Mv)    5
Star type                 0
Star color                6
Spectral Class            2
dtype: int64

In [40]:
#I want to see all the rows with missing values
rows_with_nan = newest_df[newest_df.isna().any(axis=1)]
rows_with_nan

,Temperature (K),Luminosity(L/Lo),Radius(R/Ro),Absolute magnitude(Mv),Star type,Star color,Spectral Class
3,2800,0.0002,NaN,16.65,0.0,Red,M
5,2840,NaN,0.11,16.98,0.0,Red,M
10,3600,NaN,0.51,10.69,1.0,Red,M
18,3192,NaN,0.1967,13.53,1.0,Red,M
23,8500,0.0005,0.01,14.5,2.0,NaN,A
31,30000,28840,6.3,-4.2,3.0,NaN,B
37,6380,1.35,0.98,NaN,3.0,NaN,F
44,3008,NaN,25,-6,4.0,Red,M
51,3750,283000,1260,NaN,5.0,Red,M
58,3752,209000,955,NaN,5.0,Red,NaN
65,3295,0.00098,NaN,17.13,0.0,Red,M
72,3304,0.0085,0.18,NaN,1.0,Red,M
81,10574,0.00014,NaN,12.02,2.0,White,F
89,19860,NaN,0.0131,11.34,2.0,Blue,B
91,4526,0.153,0.865,6.506,3.0,NaN,K
100,33300,240000,NaN,-6.5,4.0,NaN,B
114,NaN,132000,NaN,-10.86,5.0,Red,M
141,NaN,0.0015,0.0112,11.52,2.0,Blue,B
162,12675,NaN,83,-5.62,4.0,Blue,O
175,3614,145000,1553,NaN,5.0,Red,M
190,3462,0.0053,0.148,11.47,1.0,NaN,M
209,19360,0.00125,NaN,11.62,2.0,Blue,B
221,12749,332520,NaN,-7.02,4.0,Blue,O
231,38234,272830,1356,-9.29,5.0,Blue,NaN

In [41]:
#I will create a new Dataframe with Temperature and spectral class columns of the previous one
Temp_Spec_class_df = newest_df[['Temperature (K)', 'Spectral Class']]
Temp_Spec_class_df

    Temperature (K) Spectral Class
1              3042              M
2              2600              M
3              2800              M
4              1939              M
5              2840              M
..              ...            ...
235           38940              O
236           30839              O
237            8829              A
238            9235              A
239           37882              O

[239 rows x 2 columns]

In [42]:
#Next, I'll drop the rows wit empty values
Temp_Spec_class_df.dropna(inplace=True)
Temp_Spec_class_df.reset_index()

/tmp/ipykernel_2166/973929531.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Temp_Spec_class_df.dropna(inplace=True)

     index Temperature (K) Spectral Class
0        1            3042              M
1        2            2600              M
2        3            2800              M
3        4            1939              M
4        5            2840              M
..     ...             ...            ...
230    235           38940              O
231    236           30839              O
232    237            8829              A
233    238            9235              A
234    239           37882              O

[235 rows x 3 columns]

In [43]:
pd.get_dummies(Temp_Spec_class_df['Spectral Class'])

         A      B      F      G      K      M      O
1    False  False  False  False  False   True  False
2    False  False  False  False  False   True  False
3    False  False  False  False  False   True  False
4    False  False  False  False  False   True  False
5    False  False  False  False  False   True  False
..     ...    ...    ...    ...    ...    ...    ...
235  False  False  False  False  False  False   True
236  False  False  False  False  False  False   True
237   True  False  False  False  False  False  False
238   True  False  False  False  False  False  False
239  False  False  False  False  False  False   True

[235 rows x 7 columns]